CSI API ETABS v1
cDesignConcrete.GetSeismicFramingType Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSeismicFramingType(
	string Name,
	ref int NumberItems,
	ref string[] FrameName,
	ref int[] FramingType,
	eItemType ItemType = eItemType.Objects
)
Function GetSeismicFramingType (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef FrameName As String(),
	ByRef FramingType As Integer(),
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cDesignConcrete
Dim Name As String
Dim NumberItems As Integer
Dim FrameName As String()
Dim FramingType As Integer()
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.GetSeismicFramingType(Name,
	NumberItems, FrameName, FramingType,
	ItemType)
int GetSeismicFramingType(
	String^ Name,
	int% NumberItems,
	array<String^>^% FrameName,
	array<int>^% FramingType,
	eItemType ItemType = eItemType::Objects
)
abstract GetSeismicFramingType :
        Name : string *
        NumberItems : int byref *
        FrameName : string[] byref *
        FramingType : int[] byref *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
NumberItems
Type: System.Int32
FrameName
Type: System.String[]
FramingType
Type: System.Int32[]
ItemType (Optional)
Type: ETABSv1.eItemType
Return Value
Type: Int32
See Also
Reference
cDesignConcrete Interface
ETABSv1 Namespace